Masmiseim36/iMXRT/targets/iMXRT/devices/iMXRT1180/periph/PERI_SINC.h
#define SINC_EIS_SCD2_MASK                       (0x4U)
#define SINC_EIS_SCD2_SHIFT                      (2U)
/*! SCD2 - Short Circuit Detected Flag
 *  0b0..No effect
 *  0b0..Not detected
 *  0b1..Clear the flag
 *  0b1..Detected
 */
#define SINC_EIS_SCD2(x)                         (((uint32_t)(((uint32_t)(x)) << SINC_EIS_SCD2_SHIFT)) & SINC_EIS_SCD2_MASK)

#define SINC_EIS_SCD3_MASK                       (0x8U)
#define SINC_EIS_SCD3_SHIFT                      (3U)
/*! SCD3 - Short Circuit Detected Flag
 *  0b0..No effect
 *  0b0..Not detected
 *  0b1..Clear the flag
 *  0b1..Detected
 */
#define SINC_EIS_SCD3(x)                         (((uint32_t)(((uint32_t)(x)) << SINC_EIS_SCD3_SHIFT)) & SINC_EIS_SCD3_MASK)

#define SINC_EIS_WLMT0_MASK                      (0x100U)
#define SINC_EIS_WLMT0_SHIFT                     (8U)
/*! WLMT0 - Window Limit Flag
 *  0b0..No effect
 *  0b0..Not exceeded
 *  0b1..Clear the flag
 *  0b1..Exceeded
 */
#define SINC_EIS_WLMT0(x)                        (((uint32_t)(((uint32_t)(x)) << SINC_EIS_WLMT0_SHIFT)) & SINC_EIS_WLMT0_MASK)

#define SINC_EIS_WLMT1_MASK                      (0x200U)
#define SINC_EIS_WLMT1_SHIFT                     (9U)
/*! WLMT1 - Window Limit Flag
 *  0b0..No effect
 *  0b0..Not exceeded
 *  0b1..Clear the flag
 *  0b1..Exceeded
 */
#define SINC_EIS_WLMT1(x)                        (((uint32_t)(((uint32_t)(x)) << SINC_EIS_WLMT1_SHIFT)) & SINC_EIS_WLMT1_MASK)

#define SINC_EIS_WLMT2_MASK                      (0x400U)
#define SINC_EIS_WLMT2_SHIFT                     (10U)
/*! WLMT2 - Window Limit Flag
 *  0b0..No effect
 *  0b0..Not exceeded
 *  0b1..Clear the flag
 *  0b1..Exceeded
 */
#define SINC_EIS_WLMT2(x)                        (((uint32_t)(((uint32_t)(x)) << SINC_EIS_WLMT2_SHIFT)) & SINC_EIS_WLMT2_MASK)

#define SINC_EIS_WLMT3_MASK                      (0x800U)
#define SINC_EIS_WLMT3_SHIFT                     (11U)
/*! WLMT3 - Window Limit Flag
 *  0b0..No effect
 *  0b0..Not exceeded
 *  0b1..Clear the flag
 *  0b1..Exceeded
 */
#define SINC_EIS_WLMT3(x)                        (((uint32_t)(((uint32_t)(x)) << SINC_EIS_WLMT3_SHIFT)) & SINC_EIS_WLMT3_MASK)

#define SINC_EIS_LLMT0_MASK                      (0x10000U)
#define SINC_EIS_LLMT0_SHIFT                     (16U)
/*! LLMT0 - Low Limit Flag
 *  0b0..No effect
 *  0b0..Not exceeded
 *  0b1..Clear the flag
 *  0b1..Exceeded
 */
#define SINC_EIS_LLMT0(x)                        (((uint32_t)(((uint32_t)(x)) << SINC_EIS_LLMT0_SHIFT)) & SINC_EIS_LLMT0_MASK)

#define SINC_EIS_LLMT1_MASK                      (0x20000U)
#define SINC_EIS_LLMT1_SHIFT                     (17U)
/*! LLMT1 - Low Limit Flag
 *  0b0..No effect
 *  0b0..Not exceeded
 *  0b1..Clear the flag
 *  0b1..Exceeded
 */
#define SINC_EIS_LLMT1(x)                        (((uint32_t)(((uint32_t)(x)) << SINC_EIS_LLMT1_SHIFT)) & SINC_EIS_LLMT1_MASK)

#define SINC_EIS_LLMT2_MASK                      (0x40000U)
#define SINC_EIS_LLMT2_SHIFT                     (18U)
/*! LLMT2 - Low Limit Flag
 *  0b0..No effect
 *  0b0..Not exceeded
 *  0b1..Clear the flag
 *  0b1..Exceeded
 */
#define SINC_EIS_LLMT2(x)                        (((uint32_t)(((uint32_t)(x)) << SINC_EIS_LLMT2_SHIFT)) & SINC_EIS_LLMT2_MASK)

#define SINC_EIS_LLMT3_MASK                      (0x80000U)
#define SINC_EIS_LLMT3_SHIFT                     (19U)
/*! LLMT3 - Low Limit Flag
 *  0b0..No effect
 *  0b0..Not exceeded
 *  0b1..Clear the flag
 *  0b1..Exceeded
 */
#define SINC_EIS_LLMT3(x)                        (((uint32_t)(((uint32_t)(x)) << SINC_EIS_LLMT3_SHIFT)) & SINC_EIS_LLMT3_MASK)

#define SINC_EIS_HLMT0_MASK                      (0x1000000U)
#define SINC_EIS_HLMT0_SHIFT                     (24U)
/*! HLMT0 - High Limit Flag
 *  0b0..No effect
 *  0b0..Not exceeded
 *  0b1..Clear the flag
 *  0b1..Exceeded
 */
#define SINC_EIS_HLMT0(x)                        (((uint32_t)(((uint32_t)(x)) << SINC_EIS_HLMT0_SHIFT)) & SINC_EIS_HLMT0_MASK)

#define SINC_EIS_HLMT1_MASK                      (0x2000000U)
#define SINC_EIS_HLMT1_SHIFT                     (25U)
/*! HLMT1 - High Limit Flag
 *  0b0..No effect
 *  0b0..Not exceeded
 *  0b1..Clear the flag
 *  0b1..Exceeded
 */
#define SINC_EIS_HLMT1(x)                        (((uint32_t)(((uint32_t)(x)) << SINC_EIS_HLMT1_SHIFT)) & SINC_EIS_HLMT1_MASK)

#define SINC_EIS_HLMT2_MASK                      (0x4000000U)
#define SINC_EIS_HLMT2_SHIFT                     (26U)
/*! HLMT2 - High Limit Flag
 *  0b0..No effect
 *  0b0..Not exceeded
 *  0b1..Clear the flag
 *  0b1..Exceeded
 */
#define SINC_EIS_HLMT2(x)                        (((uint32_t)(((uint32_t)(x)) << SINC_EIS_HLMT2_SHIFT)) & SINC_EIS_HLMT2_MASK)

#define SINC_EIS_HLMT3_MASK                      (0x8000000U)
#define SINC_EIS_HLMT3_SHIFT                     (27U)
/*! HLMT3 - High Limit Flag
 *  0b0..No effect
 *  0b0..Not exceeded
 *  0b1..Clear the flag
 *  0b1..Exceeded
 */
#define SINC_EIS_HLMT3(x)                        (((uint32_t)(((uint32_t)(x)) << SINC_EIS_HLMT3_SHIFT)) & SINC_EIS_HLMT3_MASK)
/*! @} */

/*! @name FIFOIS - FIFO And CAD Error Interrupt Status */
/*! @{ */

#define SINC_FIFOIS_FUNF0_MASK                   (0x1U)
#define SINC_FIFOIS_FUNF0_SHIFT                  (0U)
/*! FUNF0 - FIFO Underflow Flag
 *  0b0..Did not occur
 *  0b0..No effect
 *  0b1..Clear the flag
 *  0b1..Occurred
 */
#define SINC_FIFOIS_FUNF0(x)                     (((uint32_t)(((uint32_t)(x)) << SINC_FIFOIS_FUNF0_SHIFT)) & SINC_FIFOIS_FUNF0_MASK)

#define SINC_FIFOIS_FUNF1_MASK                   (0x2U)
#define SINC_FIFOIS_FUNF1_SHIFT                  (1U)
/*! FUNF1 - FIFO Underflow Flag
 *  0b0..Did not occur
 *  0b0..No effect
 *  0b1..Clear the flag
 *  0b1..Occurred
 */
#define SINC_FIFOIS_FUNF1(x)                     (((uint32_t)(((uint32_t)(x)) << SINC_FIFOIS_FUNF1_SHIFT)) & SINC_FIFOIS_FUNF1_MASK)

#define SINC_FIFOIS_FUNF2_MASK                   (0x4U)
#define SINC_FIFOIS_FUNF2_SHIFT                  (2U)
/*! FUNF2 - FIFO Underflow Flag
 *  0b0..Did not occur
 *  0b0..No effect
 *  0b1..Clear the flag
 *  0b1..Occurred
 */
#define SINC_FIFOIS_FUNF2(x)                     (((uint32_t)(((uint32_t)(x)) << SINC_FIFOIS_FUNF2_SHIFT)) & SINC_FIFOIS_FUNF2_MASK)

#define SINC_FIFOIS_FUNF3_MASK                   (0x8U)
#define SINC_FIFOIS_FUNF3_SHIFT                  (3U)
/*! FUNF3 - FIFO Underflow Flag
 *  0b0..Did not occur
 *  0b0..No effect
 *  0b1..Clear the flag
 *  0b1..Occurred
 */
#define SINC_FIFOIS_FUNF3(x)                     (((uint32_t)(((uint32_t)(x)) << SINC_FIFOIS_FUNF3_SHIFT)) & SINC_FIFOIS_FUNF3_MASK)

